In [3]:
import pandas as pd

In [5]:
series1 = pd.Series([10, -1, 8, -5, 3])
series1

0    10
1    -1
2     8
3    -5
4     3
dtype: int64

In [6]:
type(series1)

pandas.core.series.Series

In [7]:
series1.values

array([10, -1,  8, -5,  3], dtype=int64)

In [8]:
series1.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
series2 = pd.Series([10, -1, 8, -5, 3], index=['a', 'b', 'c', 'd', 'e'])
series2

a    10
b    -1
c     8
d    -5
e     3
dtype: int64

In [12]:
data = { 
    'names': ['somang', 'jimin', 'jhope', 'rm', 'suga'],
    'year': [2017, 2018, 2020, 1995, 1987],
    'points': [1.5, 1.9, 2.1, 3.3, 5.8]
}
data

{'names': ['somang', 'jimin', 'jhope', 'rm', 'suga'],
 'points': [1.5, 1.9, 2.1, 3.3, 5.8],
 'year': [2017, 2018, 2020, 1995, 1987]}

In [15]:
dataframe1 = pd.DataFrame(data)
dataframe1

    names  points  year
0  somang     1.5  2017
1   jimin     1.9  2018
2   jhope     2.1  2020
3      rm     3.3  1995
4    suga     5.8  1987

In [16]:
dataframe1.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
dataframe1.columns

Index(['names', 'points', 'year'], dtype='object')

In [18]:
dataframe1.values

array([['somang', 1.5, 2017],
       ['jimin', 1.9, 2018],
       ['jhope', 2.1, 2020],
       ['rm', 3.3, 1995],
       ['suga', 5.8, 1987]], dtype=object)

In [21]:
dataframe2 = pd.DataFrame(
    data,
    columns=['year', 'names', 'points', 'penalty'],
    index=['1st', '2nd', '3rd', '4th', '5th']
)
dataframe2

     year   names  points penalty
1st  2017  somang     1.5     NaN
2nd  2018   jimin     1.9     NaN
3rd  2020   jhope     2.1     NaN
4th  1995      rm     3.3     NaN
5th  1987    suga     5.8     NaN

In [22]:
dataframe2.describe()

              year    points
count     5.000000  5.000000
mean   2007.400000  2.920000
std      15.274161  1.744133
min    1987.000000  1.500000
25%    1995.000000  1.900000
50%    2017.000000  2.100000
75%    2018.000000  3.300000
max    2020.000000  5.800000

In [23]:
import numpy as np
dataframe2.describe(include=[np.object])

         names  penalty
count        5      0.0
unique       5      0.0
top     somang      NaN
freq         1      NaN